html/diff.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-12 Sat 21:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Hsin-Hao Yu" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org399f0e5">1. Numerical differentiation using iterators</a>
<ul>
<li><a href="#org1bfcd05">1.1. A first stab at the problem</a></li>
<li><a href="#org4aa0e70">1.2. Improving convergence with lazy recursive functions</a></li>
<li><a href="#org3eb35bc">1.3. Super improvements</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org399f0e5" class="outline-2">
<h2 id="org399f0e5"><span class="section-number-2">1</span> Numerical differentiation using iterators</h2>
<div class="outline-text-2" id="text-1">
<p>
From a glance, this section of Hughes' paper appears to be all about numerical methods that are only of interest to the readers of <a href="http://numerical.recipes">Numerical Recipes</a>. But do read on. This is where lazy evaluation starts to look cool.
</p>
</div>

<div id="outline-container-org1bfcd05" class="outline-3">
<h3 id="org1bfcd05"><span class="section-number-3">1.1</span> A first stab at the problem</h3>
<div class="outline-text-3" id="text-1-1">
<p>
For a real function <code>f</code>, the first-order approximation of <code>f'</code> at <code>x</code> can be obtained by displacing <code>x</code> by <code>h</code>, and then calculate the slope:
</p>

<div class="org-src-container">
<pre class="src src-python">import copy
from math import log2, sin
from typing import Callable, Iterator
from itertools import chain, tee 
from lazy_utils import repeat_f, within


esp = 0.000000001 # a small number that's used to call within()

def easydiff(f: Callable[[float], float], x: float) -&gt; float:
    def easydiff_(h: float):
	return (f(x + h) - f(x)) / h

    return easydiff_
</pre>
</div>

<p>
Now we generate a lazy list (i.e., iterator) of smaller and smaller <code>h</code>, by applying <code>half</code> repeatedly with <code>repeat_f</code> (defined in <code>newton.org</code>). Mapping the slope function to this iterator, <code>differentiate_</code> returns another iterator that approximates the derivative closer and closer.
</p>

<div class="org-src-container">
<pre class="src src-python">def half(x: float) -&gt; float:
    return x / 2.0

def differentiate(h0: float, f: Callable[[float], float], x: float) -&gt; Iterator:
    return map(easydiff(f, x), repeat_f(half, h0))
</pre>
</div>

<p>
This is our first version of the numerical differentiation function:
</p>

<div class="org-src-container">
<pre class="src src-python">def diff1(h0: float, f: Callable[[float], float], x: float) -&gt; float:
    d = within(esp, differentiate(h0, f, x))
    return next(d)
</pre>
</div>

<p>
A simple test: differentiate sin(x) at 1.0, starting with a very large gap (<code>h0=5.0</code>). We know that the right answer is cos(1.0).
</p>

<div class="org-src-container">
<pre class="src src-python">import pytest
from itertools import *
from math import cos

from diff import *

def f(x):
    return sin(x)

def test_diff1():
    x = 1.0
    h0 = 5.0
    d = diff1(h0, f, x)
    assert d == pytest.approx(cos(x))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4aa0e70" class="outline-3">
<h3 id="org4aa0e70"><span class="section-number-3">1.2</span> Improving convergence with lazy recursive functions</h3>
<div class="outline-text-3" id="text-1-2">
<p>
A problem with <code>differentiate</code> above is that the sequence converges very slowly. This sections uses numerical tricks to improve the convergence. The math is not our concern here. We will focus just on code structure. 
</p>

<p>
With some math, it can be shown that with an appropriately chosen integer <code>n</code>, convergence can improved with the <code>elimerror</code> function defined below. What it does is that it slides a two-item window over the original sequence, and applies a correction (<code>c</code> below). 
</p>

<p>
To accomplish this, we need to add something to the beginning of an iterator, which is done with <code>itertools.chain</code> in Python. The following Python code is still short and sweet, but the original Miranda code is much nicer. This is because Miranda evaluates lazily by default, so there is no need for <code>yield</code>:
</p>

<div class="org-src-container">
<pre class="src src-python">def elimerror__(n: int, itr: Iterator) -&gt; Iterator:
    a, b = next(itr), next(itr)
    p: float = 2.0 ** n
    c: float = (b * p - a) / (p - 1.0)

    for x in chain([c], elimerror(n, chain([b], itr))):
	yield x
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">def elimerror(n, itr):
    a = next(itr)
    while True:
	b = next(itr)
	p = 2.0 ** n
	c = (b * p - a) / (p - 1.0)
	yield c
	a = b
</pre>
</div>

<p>
We don't know how to set <code>n</code> yet, but let's try the code with an arbitrary number (<code>n=2.0</code>). 
</p>

<div class="org-src-container">
<pre class="src src-python">def test_elimerror():
    print("\n## test_elimerror:")

    def f(x):
	return sin(x)

    seq1 = differentiate(5.0, f, 1.0)
    print("seq1:", list(islice(seq1, 20)))

    seq1 = differentiate(5.0, f, 1.0)     
    seq2 = elimerror(2.0, seq1)

    print("seq2:", list(islice(seq2, 20)))
</pre>
</div>

<p>
The appropriate <code>n</code> can be estimated by <code>order</code>, using the first three values in the sequence. Taking a slow converging iterator as input, <code>improve</code> returns a new iterator that converges much faster. It does it by estimating the order and calling <code>elimerror</code>.
</p>

<div class="org-src-container">
<pre class="src src-python">def order(itr: Iterator) -&gt; int:
    a, b, c = next(itr), next(itr), next(itr)
    return round(log2((a - c) / (b - c) - 1.0))

def improve(itr: Iterator) -&gt; Iterator:
    (itr1, itr2) = tee(itr)
    n: int = order(itr1)
    return elimerror(n, itr2)
</pre>
</div>

<p>
If you run <code>make test</code>, you can see that <code>improve(seq1)</code> converges to the correct answer 0.6  much faster.
</p>

<div class="org-src-container">
<pre class="src src-python">def test_improve():
    print("\n## test_improve")

    def f(x):
	return sin(x)

    seq1 = differentiate(2.0, f, 0.3)
    print("seq1:", list(islice(seq1, 20)))

    seq1 = differentiate(2.0, f, 0.3)
    seq2 = improve(seq1)

    print("seq2:", list(islice(seq2, 20)))
</pre>
</div>

<p>
This is the improved differentiation function. The logic is very clear: generate a series of rough calculations, improve the them, and stop when the convergence criterion is met. 
</p>

<div class="org-src-container">
<pre class="src src-python">def diff2(h0: float, f: Callable[[float], float], x: float) -&gt; float:
    d = within(esp, improve(differentiate(h0, f, x)))
    return next(d)
</pre>
</div>

<p>
A simple test:
</p>

<div class="org-src-container">
<pre class="src src-python">def test_diff2():
    def f(x):
	return sin(x)

    h0 = 1.0
    x = 0.3
    d = diff2(h0, f, x)
    assert d == pytest.approx(cos(x))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3eb35bc" class="outline-3">
<h3 id="org3eb35bc"><span class="section-number-3">1.3</span> Super improvements</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Do we actually need any improvements? Not for the simple differentiation problem that we've been doing, but this is where the code gets really interesting!
</p>

<p>
The <code>super_</code> function below applies <code>improve</code> repeatedly to iterator <code>itr</code> (<code>repeat_f</code> is defined in <code>newton.org</code>), so the returned object is an infinite iterator of infinite iterators! It's <code>[itr, improve(itr), improve(improve(itr))...]</code> and so on.
</p>

<div class="org-src-container">
<pre class="src src-python">def super__(itr):
    return repeat_itr(improve, itr)

def second(itr):
    next(itr)
    return next(itr)

def super_(itr):
    return map(second, super__(itr))

def super_differentiate(h0, f, x):
    return super_(differentiate(h0, f, x))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Hsin-Hao Yu</p>
<p class="date">Created: 2022-03-12 Sat 21:25</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
